Podkova/src/DataProcessors/Шиномонтаж/Шиномонтаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Шиномонтаж</name>
  <attributes>
    <name>Бригадир</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Podkova/src/InformationRegisters/ШМ_Кнопки/ШМ_Кнопки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШМ_Кнопки</name>
  <dimensions>
    <name>ШиринаКнопки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВысотаКнопки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КоличествоКолонок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/DataProcessors/Шиномонтаж/Forms/Настройка/Module.bsl
&НаКлиенте
Процедура ОК(Команда)
	ОКНаСервере();
	ОткрытьФорму("Обработка.Шиномонтаж.Форма.Форма");
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОКНаСервере()
	НаборЗаписей = РегистрыСведений.ШМ_Кнопки.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	НоваяЗапись = РегистрыСведений.ШМ_Кнопки.СоздатьМенеджерЗаписи();
    НоваяЗапись.ВысотаКнопки = ВысотаКнопки;
	НоваяЗапись.ШиринаКнопки = ШиринаКнопки;
	НоваяЗапись.КоличествоКолонок = КоличествоКолонок;
	НоваяЗапись.Записать();
	
	Константы.ШМ_ВыводитьТоварныйЧек.Установить(ВыводитьТоварныйЧек);
	Константы.ШМ_КоличествоБирок.Установить(КоличествоБирок);
	Константы.ШМ_Игла.Установить(Игла);
	Константы.ШМ_Домкрат.Установить(Домкрат);
	Константы.ШМ_ВизиткиСкидки.Установить(ВизиткиСкидки);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВысотаКнопки = 10;
	ШиринаКнопки = 15;
	КоличествоКолонок = 5;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШМ_Кнопки.ШиринаКнопки,
		|	ШМ_Кнопки.ВысотаКнопки,
		|	ШМ_Кнопки.КоличествоКолонок
		|ИЗ
		|	РегистрСведений.ШМ_Кнопки КАК ШМ_Кнопки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ВысотаКнопки = Выборка.ВысотаКнопки;
		ШиринаКнопки = Выборка.ШиринаКнопки;
		КоличествоКолонок = Выборка.КоличествоКолонок;
	КонецЦикла;
	ВыводитьТоварныйЧек = Константы.ШМ_ВыводитьТоварныйЧек.Получить();
	КоличествоБирок = Константы.ШМ_КоличествоБирок.Получить();
	Игла = Константы.ШМ_Игла.Получить();
	Домкрат = Константы.ШМ_Домкрат.Получить();
	ВизиткиСкидки = Константы.ШМ_ВизиткиСкидки.Получить();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОткрытьФорму("Обработка.Шиномонтаж.Форма.Форма");
КонецПроцедуры
